#include "Geometory.h"

void Geometory::MakeBox()
{
	//--- 頂点の作成
	Vertex vtx[] = {
		// -Z面 
		{{-0.5f, 0.5f, -0.5f}, {0.0f, 0.0f}},
		{{ 0.5f, 0.5f, -0.5f}, {1.0f, 0.0f}},
		{{-0.5f,-0.5f, -0.5f}, {0.0f, 1.0f}},
		{{ 0.5f,-0.5f, -0.5f}, {1.0f, 1.0f}},
		// +Z面 
		{{-0.5f, 0.5f,  0.5f}, {0.0f, 0.0f}},
		{{ 0.5f, 0.5f,  0.5f}, {1.0f, 0.0f}},
		{{-0.5f,-0.5f,  0.5f}, {0.0f, 1.0f}},
		{{ 0.5f,-0.5f,  0.5f}, {1.0f, 1.0f}},
		//+x
		{{ 0.5f, 0.5f,-0.5f}, {0.0f, 0.0f}},
		{{ 0.5f, 0.5f,  0.5f}, {1.0f, 0.0f}},
		{{ 0.5f,-0.5f,-0.5f}, {0.0f, 1.0f}},
		{{ 0.5f,-0.5f, 0.5f}, {1.0f, 1.0f}},
		//-x
		{{ -0.5f, 0.5f,-0.5f}, {0.0f, 0.0f}},
		{{ -0.5f, 0.5f,  0.5f}, {1.0f, 0.0f}},
		{{ -0.5f,-0.5f,-0.5f}, {0.0f, 1.0f}},
		{{ -0.5f,-0.5f, 0.5f}, {1.0f, 1.0f}},
		//+y
		{{-0.5f, 0.5f, -0.5f}, {0.0f, 0.0f}},
		{{-0.5f, 0.5f,  0.5f}, {1.0f, 0.0f}},
		{{ 0.5f, 0.5f, -0.5f}, {0.0f, 1.0f}},
		{{ 0.5f, 0.5f,  0.5f}, {1.0f, 1.0f}},
		//-y
		{{-0.5f, -0.5f, -0.5f}, {0.0f, 0.0f}},
		{{-0.5f, -0.5f,  0.5f}, {1.0f, 0.0f}},
		{{ 0.5f, -0.5f, -0.5f}, {0.0f, 1.0f}},
		{{ 0.5f, -0.5f,  0.5f}, {1.0f, 1.0f}},
	};


	//--- インデックスの作成
	int idx[] = {
		0, 1, 2,  1, 3, 2, // -Z面 
		4, 6, 5,  5, 6, 7, // +Z面 

		8, 9, 10,  9, 11, 10, //+x
		13,12,14, 13, 14, 15, //-x

		16, 17, 18,  17, 19, 18, //+y
		21, 20, 22,  21, 22, 23, //-y
	};

	// バッファの作成
	MeshBuffer::Description desc = {};
	desc.pVtx= vtx;
	desc.vtxCount = 24;
	desc.vtxSize = 20;
	desc.pIdx = idx;
	desc.idxCount = 36;
	desc.idxSize = 4;
	desc.topology = D3D11_PRIMITIVE_TOPOLOGY_TRIANGLELIST;
	m_pBox = new MeshBuffer();
	m_pBox->Create(desc);
}

void Geometory::MakeCylinder()
{
	//--- 頂点の作成
	// 天面、底面

	// 側面

	//--- インデックスの作成
	// 天面、底面

	// 側面


	//--- バッファの作成
}

void Geometory::MakeSphere()
{
	//--- 頂点の作成

	//--- インデックスの作成

	// バッファの作成
}